proj/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('joao', 'joao@joao.com', '$2y$13$DaYbksmgN8.6TID5nuwQouEZ9KX6A8nUwK/uCK41vbBjgiiNJwVIG', 'fjnydRgeD8HbmkVNCdd2y5l2F3UNEeYX', 'Fv1Oxnc_BxCGFL3j3I30UPFXSlztJ2Ez_1728940363', 9, 1728940363, 1728940363)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        $userInfo = new UserInfo();
        $userInfo->name = $this->name;
        $userInfo->address = $this->address;
        $userInfo->postal_code = $this->postalCode;

        if ($user->save() && $this->sendEmail($user)) {